"""
Создайте функцию, которая читает файл CSV и возвращает список словарей,
где ключами являются имена в первой строке

Пример: {'DoB': '08/18/2007', 'Name': 'Annabel', 'Ordinal': '1'},

CSV файл лежит в 'data/data.csv'

Проблема: что произойдет, если строка будет слишком длинной или короткими?
Что происходит с повторяющимися именами в первом ряду.

Дополнительно: конвертировать строки DoB в даты Python datetime.dates.
"""
import csv


def read_csv(file_name='data/data.csv'):
    """Вернуть список словарей из CSV файла"""
    # Your code goes here
    pass

