"""
Работа со списками

Получить первые элементы
======================= 
Пример:
Дано: x = [('A','x'), ('B','y'), ('C','z')]
Результат: ['A','B','C']

Смещение элементов
=============
Поверните список, взяв значение с одного конца и поместив его на другом конце.
Создайте две функции rotate_left () и rotate_right (), которые изменяют список
следующим образом, учитывая список ['A', 'B', 'C']:

rotate_left() меняет на ['B', 'C', 'A']
rotate_right() меняет на ['C', 'A', 'B']
"""


def select_first_items():
    """Получение первых элементов"""
    x = [('A', 'x'), ('B', 'y'), ('C', 'z')]
    # Your code goes here


def rotate_left(alist):
    """Смещение конца списка влево"""
    pass


def rotate_right(alist):
    """Смещение конца списка вправо"""
    pass
